#include <iostream>
#include <tchar.h>
#include <locale>
#include <string>
#include <math.h>
#include <algorithm>


int _tmain(int argc, _TCHAR* argv[])
{
	int total_moves = 0; // Счётчик ходов
    std::string a; // строка текущего кода
    std::string b; // строка текущего кода
    // Установка русской локали для терминала Windows 11
    // 1-й способ. Выплнить внешнюю команду.
    system("chcp 1251 >nul");
    // 2 - й способ. Вызов библиотечной функции.
    setlocale(LC_ALL, "russian.1251");
    // 3 - й способ. Создать переменную типа локали.
    std::locale rus_locale = std::locale("russian.1251");
    // 3 - й способ. Выбор кодировки(локали) терминала
    std::cout.imbue(std::locale::global(rus_locale));
    // Чтение входных данных
    std::cout << "Введите текущий код: ";
    std::getline(std::cin, a);  // Ввод текущего кода
    std::cout << "Введите целевой код: ";
    std::getline(std::cin, b);  // Ввод целового кода
    int n_len1 = a.length();  // Вычислить длину 1-ой строки
    int n_len2 = b.length();  // Вычислить длину 2-ой строки
    // Проверка на совпадение длины текущего и целевого кода
    // Если длина текущего кода не равна длине целевого
    // и оба кода не четырёхзначные, программа завершает работу.
    if ((n_len1 != 4) || (n_len2 != 4) || (n_len1 != n_len2))
    {
        std::cout << "Комбинация кодового замка должна быть 4 цифры.\r\n";
        std::cout << "Текущий и целевой код должны быть одинаковой длины.\r\n";
        // Задержка вывода на экран до нажатия клавиши "Ввод"
        std::cin.ignore();
        std::cin.get();
        return 0;
    }
    // Подсчет минимального количества ходов
    for (int i = 0; i < n_len1; i++)
    {
        int x = a[i]; // выделить цифру текущего кода
        int y = b[i]; // // выделить цифру целевого кода
        int diff1 = abs(x - y);  // разность цифр, прямой ход диска
        int diff2 = 10 - abs(x - y);  // разность цифр, обратный ход диска
        // Мнинимальное число ходов - разность между каждой цифрой диска
        // в целевом коде и текущем коде замка сейфа
        // Общее число ходов - ответ на вопрос
        total_moves += std::min(diff1, diff2);
    }
    // Вывод информации на экран
    std::cout << "Текущий код:" << a << "\r\n";
    std::cout << "Целевой код:" << b << "\r\n";
    std::cout << "Мнинимальное число ходов:" << total_moves << "\r\n";
    // Задержка вывода на экран до нажатия клавиши "Ввод"
    std::cin.ignore();
    std::cin.get();
    return 0;
}
